Repository: Gubchik123/WeatherGubchikBot
Catalog: bot/locales/ua/LC_MESSAGES/messages.po
Languages: ua

source: You are in the main menu. Select further actions with the buttons below.
ua: Ви у головному меню. Виберіть подальші дії за допомогою кнопок нижче.

source: I don't understand you :( I advise you to use the buttons or commands for the intended result.
ua: Я Вас не розумію :( Раджу використати кнопки або команди для задуманого результату.

source: end communication
ua: завершити спілкування

source: Bye, {name}, come bake again! Next time just type or press /start
ua: До побачення, {name}, повертайтесь ще! Наступного разу просто введіть або натисніть /start

source: Bot commands: /start - Start working with the bot /help - Get basic usage rules /menu - Get main menu /moon ([date: DD.MM.YYYY]) - Get moon phase /weather ([language code: {languages}] [weather provider: {providers}] [city] [period]) - Get weather forecast /profile - Get user profile /mailing ([language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)]) - Get mailing menu / Sign up for or update the newsletter /goodbye - Pause working with the bot Sign up for the newsletter (/mailing) to receive daily weather information in the city of your choice (you can turn it off at any time) I advise you to use the buttons or commands for the intended result Enjoy using!!! You can suggest an idea or report a bug by following the link: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Bot author contacts: CV site: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1691 Other projects of the author are available on: Portfolio: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123
ua: Команди бота: /start - Початок роботи з ботом /help - Отримати основні правила використання /menu - Отримати головне меню /moon ([дата: ДД.ММ.РРРР]) - Отримати фазу місяця /weather ([код мови: {languages}] [сайт погоди: {providers}] [місто] [період]) - Отримати прогноз погоди /profile - Отримати профіль користувача /mailing ([код мови: {languages}] [сайт погоди: {providers}] [місто] [період] [час: {times}] [беззвучний: True (t,1) / False (f,0)]) - Отримати меню розсилки / Підписатися або оновити розсилку /goodbye - Призупинити роботу з ботом Оформіть розсилку, щоб кожного дня дізнаватися інформацію про погоду в місті, яке ви обирете (в будь-який час її можно відключити) Раджу використати кнопки для задуманого результату Приємного використання!!! Ви можете запропонувати ідею або повідомити про помилку, перейшовши за посиланням: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Контакти автора бота: Сайт резюме: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1691 Інші проекти автора доступні на: Портфоліо: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123

source: {bot_username} commands: /help@{bot_username} - Get basic usage rules /moon@{bot_username} ([date: DD.MM.YYYY]) - Get moon phase /weather@{bot_username} [language code: {languages}] [weather provider: {providers}] [city] [period] - Get weather forecast /mailing ([language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)]) - Sign up for or update the newsletter /unsubscribe_mailing - Unsubscribe from the newsletter Enjoy using!!! You can suggest an idea or report a bug by following the link: https://github.com/Gubchik123/WeatherGubchikBot/issues/new {bot_username} author contacts: CV site: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1691 Other projects of the author are available on: Project board: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123
ua: Команди {bot_username}: /help@{bot_username} - Отримати основні правила використання /moon@{bot_username} ([дата: ДД.ММ.РРРР]) - Отримати фазу місяця /weather@{bot_username} [код мови: {languages}] [сайт погоди: {providers}] [місто] [період] - Отримати прогноз погоди /mailing ([код мови: {languages}] [сайт погоди: {providers}] [місто] [період] [час: {times}] [беззвучний: True (t,1) / False (f,0)]) - Підписатися або оновити розсилку /unsubscribe_mailing - Відписатися від розсилки Приємного використання!!! Ви можете запропонувати ідею або повідомити про помилку, перейшовши за посиланням: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Контакти автора {bot_username}: Сайт резюме: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1691 Інші проекти автора доступні на: Дошка проектів: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123

source: ❌Invalid date format. Expected: DD.MM.YYYY
ua: ❌Невірний формат дати. Очікувався: ДД.ММ.РРРР

source: Full Moon
ua: Повний місяць

source: Waning Gibbous
ua: Спадаючий Місяць

source: Third Quarter
ua: Остання чверть

source: Waning Crescent
ua: Старий Місяць

source: New Moon
ua: Новий Місяць

source: Waxing Crescent
ua: Молодий Місяць

source: First Quarter
ua: Перша чверть

source: Waxing Gibbous
ua: Прибувающий Місяць

source: Unknown
ua: Невідомо

source: Hello, {name}! I am the one who will help you find out information about the weather in cities around the world.
ua: Привіт, {name}! Я той, хто допоможе Вам дізнатися інформацію про погоду в містах по всьому світу.

source: ❌ Invalid number of arguments. Expected 6 arguments: [language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)])
ua: ❌ Невірна кількість аргументів. Очікувалось 6 аргументів: [код мови: {languages}] [сайт погоди: {providers}] [місто] [період] [час: {times}] [беззвучний: True (t,1) / False (f,0)])

source: ❌ Unknown time. Expected one of: {times}
ua: ❌ Невідомий час. Очікувався один з: {times}

source: ❌ Invalid mute mode. Expected: True (t,1) or False (f,0)
ua: ❌ Невірний режим беззвучності. Очікувався: True (t,1) або False (f,0)

source: mailing
ua: розсилка

source: Do you really want to subscribe to the daily weather forecast mailing?
ua: Ви дійсно хочете підписатися на щоденну розсилку прогнозу погоди?

source: <b>Mailing</b> Mode: {mode} Daily at {time_int}:00 Forecast period: {time} City / locality: {city}
ua: <b>Розсилка</b> Режим: {mode} Щодня о {time_int}:00 Період прогнозу: {time} Місто / населений пункт: {city}

source: silent
ua: беззвучний

source: alert
ua: зі звуком

source: At what time would you like to receive the newsletter?
ua: О котрій годині ви бажаєте отримувати розсилку?

source: You have successfully completed the mailing setup!
ua: Ви успішно завершили налаштування розсилки!

source: Are you sure you want to unsubscribe from the mailing?
ua: Ви впевнені, що хочете відписатися від розсилки?

source: You have successfully unsubscribed from the mailing!
ua: Ви успішно відписалися від розсилки!

source: Searching...
ua: Пошук...

source: The mailing city has been successfully updated!
ua: Місто розсилки успішно оновлено!

source: The mailing has been muted!
ua: Беззвучний режим розсилки увімкнено!

source: The mailing has been unmuted!
ua: Беззвучний режим розсилки вимкнено!

source: The mailing period has been successfully updated!
ua: Період прогнозу розсилки успішно оновлено!

source: The mailing time has been successfully updated!
ua: Час розсилки успішно оновлено!

source: Language successfully changed to {locale}!
ua: Мову успішно змінено на {locale}!

source: profile
ua: профіль

source: <b>Profile</b> Language: <i>{locale}</i> Timezone: <i>{timezone}</i> Weather provider: <i>{weather_provider}</i> Date you joined: <i>{created}</i>
ua: <b>Профіль</b> Мова: <i>{locale}</i> Часовий пояс: <i>{timezone}</i> Сайт погоди: <i>{weather_provider}</i> Дата приєднання: <i>{created}</i>

source: You have no search history yet.
ua: У вас ще немає історії пошуку.

source: Select cities from your search history you want to delete:
ua: Виберіть міста з вашої історії пошуку, які ви хочете видалити:

source: No cities selected.
ua: Міста не вибрані.

source: Selected cities deleted.
ua: Вибрані міста видалено.

source: <b>Changing timezone.</b> You can choose a new time zone by choosing from the options below.
ua: <b>Зміна часового поясу.</b> Ви можете вибрати новий часовий пояс з варіантів нижче.

source: Choose a city in {country}:
ua: Виберіть місто в {country}:

source: Timezone successfully changed to {timezone}!
ua: Часовий пояс успішно змінено на {timezone}!

source: <b>Changing weather provider.</b> You can choose a new weather provider below:
ua: <b>Зміна сайту погоди.</b> Ви можете вибрати новий сайт погоди нижче:

source: Weather provider successfully changed to {weather_provider}!
ua: Сайт погоди успішно змінено на {weather_provider}!

source: weather forecast
ua: прогноз погоди

source: Enter the name of the city / locality
ua: Введіть назву міста / населеного пункту

source: Choose the city / locality you had in mind:
ua: Виберіть місто / населений пункт, яке ви мали на увазі:

source: ❌ Invalid number of arguments. Expected 4 arguments: [language code: {languages}] [weather provider: {providers}] [city] [period]
ua: ❌ Невірна кількість аргументів. Очікувалось 4 аргументи: [код мови: {languages}] [сайт погоди: {providers}] [місто] [період]

source: ❌ Unknown language code. Expected one of: {languages}
ua: ❌ Невідомий код мови. Очікувався один з: {languages}

source: ❌ Unknown weather provider. Expected one of: {providers}
ua: ❌ Невідомий сайт погоди. Очікувався один з: {providers}

source: ❌ Exact city not found. Fuzzy search is not allowed.
ua: ❌ Точне місто не знайдено. Розмитий пошук не дозволено.

source: ❌ Invalid period.
ua: ❌ Невірний період.

source: Select the forecast period
ua: Виберіть період прогнозу

source: Processing...
ua: Опрацювання...

source: Do you want to mute the mailing?
ua: Ви хочете вимкнути звук розсилки?

source: Weather forecast
ua: Прогноз погоди

source: Profile
ua: Профіль

source: Mailing
ua: Розсилка

source: End communication
ua: Завершити спілкування

source: 🔙 Back
ua: 🔙 Назад

source: Change the mute mode
ua: Змінити беззвучний режим

source: Change the time
ua: Змінити час

source: Change the forecast period
ua: Змінити період прогнозу

source: Change the city
ua: Змінити місто

source: Unsubscribe
ua: Відписатися

source: Yes
ua: Так

source: No
ua: Ні

source: Retry the input
ua: Повторити спробу введення

source: Now
ua: Зараз

source: Today
ua: Сьогодні

source: Tomorrow
ua: Завтра

source: Week
ua: Тиждень

source: Fortnight
ua: Два тижні

source: Change language
ua: Змінити мову

source: Change timezone
ua: Змінити часовий пояс

source: Change weather provider
ua: Змінити сайт погоди

source: Manage search history
ua: Керування історією пошуку

source: 🔙 Menu
ua: 🔙 Меню

source: 🔙 Profile
ua: 🔙 Профіль

source: An error occurred! 😥 The admins have already been notified about this and will fix the problem as soon as possible. Please, try again or restart the bot with the /start command.
ua: Виникла помилка! 😥 Адміністратори вже були сповіщені про це і виправлять проблему якнайшвидше. Будь ласка, спробуйте ще раз або перезапустіть бота командою /start.

source: Unfortunately, the weather provider server is not available now. The error is not connected with the bot. Please, try again later <b>OR</b> choose another weather provider:
ua: На жаль, сервер погоди зараз недоступний. Помилка не пов'язана з ботом. Будь ласка, спробуйте пізніше <b>АБО</b> оберіть інший сайт погоди:

source: Day
ua: Вдень

source: Night
ua: Вночі
