Repository: Gubchik123/WeatherGubchikBot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: You are in the main menu. Select further actions with the buttons below.
ru: Вы в главном меню. Выберите следующие действия с помощью кнопок ниже.

source: I don't understand you :( I advise you to use the buttons or commands for the intended result.
ru: Я вас не понимаю :( Советую использовать кнопки или команды для задуманного результата.

source: end communication
ru: закончить общение

source: Bye, {name}, come bake again! Next time just type or press /start
ru: Пока, {name}, возвращайся еще! В следующий раз просто введите или нажмите /start

source: Bot commands: /start - Start working with the bot /help - Get basic usage rules /menu - Get main menu /moon ([date: DD.MM.YYYY]) - Get moon phase /weather ([language code: {languages}] [weather provider: {providers}] [city] [period]) - Get weather forecast /profile - Get user profile /mailing ([language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)]) - Get mailing menu / Sign up for or update the newsletter /goodbye - Pause working with the bot Sign up for the newsletter (/mailing) to receive daily weather information in the city of your choice (you can turn it off at any time) I advise you to use the buttons or commands for the intended result Enjoy using!!! You can suggest an idea or report a bug by following the link: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Bot author contacts: CV site: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1746 Other projects of the author are available on: Portfolio: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123
ru: Команды бота: /start - Начало работы с ботом /help - Получить основные правила использования /menu - Получить главное меню /moon ([дата: ДД.ММ.ГГГГ]) - Получить фазу луны /weather ([код языка: {languages}] [сайт погоды: {providers}] [город] [период]) - Получить прогноз погоды /profile - Получить профиль пользователя /mailing ([код языка: {languages}] [сайт погоды: {providers}] [город] [период] [время: {times}] [mute: True (t,1) / False (f,0)]) - Получить меню рассылки / Подписаться на рассылку или обновить ее /goodbye - Приостановить работу с ботом Оформите рассылку, чтобы каждый день узнавать информацию о погоде в выбранном городе (в любое время ее можно отключить) Советую использовать кнопки для задуманного результата Приятного использования!!! Вы можете предложить идею или сообщить об ошибке, перейдя по ссылке: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Контакты автора бота: Сайт резюме: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1746 Другие проекты автора доступны на: Портфолио: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123

source: {bot_username} commands: /help@{bot_username} - Get basic usage rules /moon@{bot_username} ([date: DD.MM.YYYY]) - Get moon phase /weather@{bot_username} [language code: {languages}] [weather provider: {providers}] [city] [period] - Get weather forecast /mailing ([language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)]) - Sign up for or update the newsletter /unsubscribe_mailing - Unsubscribe from the newsletter Enjoy using!!! You can suggest an idea or report a bug by following the link: https://github.com/Gubchik123/WeatherGubchikBot/issues/new {bot_username} author contacts: CV site: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1746 Other projects of the author are available on: Project board: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123
ru: Команды {bot_username}: /help@{bot_username} - Получить основные правила использования /moon@{bot_username} ([дата: ДД.ММ.ГГГГ]) - Получить фазу луны /weather@{bot_username} [код языка: {languages}] [сайт погоды: {providers}] [город] [период] - Получить прогноз погоды /mailing ([код языка: {languages}] [сайт погоды: {providers}] [город] [период] [время: {times}] [mute: True (t,1) / False (f,0)]) - Подписаться на рассылку или обновить ее /unsubscribe_mailing - Отписаться от рассылки Приятного использования!!! Вы можете предложить идею или сообщить об ошибке, перейдя по ссылке: https://github.com/Gubchik123/WeatherGubchikBot/issues/new Контакты автора {bot_username}: Сайт резюме: https://hubariev.com LinkedIn: https://www.linkedin.com/in/nikita-hubariev Instagram: https://www.instagram.com/notwhale.1746 Другие проекты автора доступны на: Доска проектов: https://portfolio.hubariev.com GitHub: https://github.com/Gubchik123

source: ❌Invalid date format. Expected: DD.MM.YYYY
ru: ❌Неверный формат даты. Ожидался: ДД.ММ.ГГГГ

source: Full Moon
ru: Полнолуние

source: Waning Gibbous
ru: Убывающая Луна

source: Third Quarter
ru: Последняя четверть

source: Waning Crescent
ru: Убывающий серп

source: New Moon
ru: Новолуние

source: Waxing Crescent
ru: Растущий серп

source: First Quarter
ru: Первая четверть

source: Waxing Gibbous
ru: Растущая луна

source: Unknown
ru: Неизвестно

source: Hello, {name}! I am the one who will help you find out information about the weather in cities around the world.
ru: Привет, {name}! Я тот, кто поможет тебе узнать информацию о погоде в городах по всему миру.

source: ❌ Invalid number of arguments. Expected 6 arguments: [language code: {languages}] [weather provider: {providers}] [city] [period] [time: {times}] [mute: True (t,1) / False (f,0)])
ru: ❌ Неверное количество аргументов. Ожидалось 6 аргументов: [код языка: {languages}] [сайт погоды: {providers}] [город] [период] [время: {times}] [mute: True (t,1) / False (f,0)])

source: ❌ Unknown time. Expected one of: {times}
ru: ❌ Неизвестное время. Ожидалось одно из: {times}

source: ❌ Invalid mute mode. Expected: True (t,1) or False (f,0)
ru: ❌ Неверный режим звука. Ожидалось: True (t,1) или False (f,0)

source: mailing
ru: рассылка

source: Do you really want to subscribe to the daily weather forecast mailing?
ru: Вы действительно хотите подписаться на ежедневную рассылку прогноза погоды?

source: <b>Mailing</b> Mode: {mode} Daily at {time_int}:00 Forecast period: {time} City / locality: {city}
ru: <b>Рассылка</b> Режим: {mode} Ежедневно в {time_int}:00 Период прогноза: {time} Город / населенный пункт: {city}

source: silent
ru: без звука

source: alert
ru: со звуком

source: At what time would you like to receive the newsletter?
ru: В какое время Вы хотите получать рассылку?

source: You have successfully completed the mailing setup!
ru: Вы успешно завершили настройку рассылки!

source: Are you sure you want to unsubscribe from the mailing?
ru: Вы уверены, что хотите отписаться от рассылки?

source: You have successfully unsubscribed from the mailing!
ru: Вы успешно отписались от рассылки!

source: Searching...
ru: Поиск...

source: The mailing city has been successfully updated!
ru: Город рассылки успешно обновлен!

source: The mailing has been muted!
ru: Включен режим без звука!

source: The mailing has been unmuted!
ru: Включен режим со звуком!

source: The mailing period has been successfully updated!
ru: Период рассылки успешно обновлен!

source: The mailing time has been successfully updated!
ru: Время рассылки успешно обновлено!

source: Language successfully changed to {locale}!
ru: Язык успешно изменен на {locale}!

source: profile
ru: профиль

source: <b>Profile</b> Language: <i>{locale}</i> Timezone: <i>{timezone}</i> Weather provider: <i>{weather_provider}</i> Date you joined: <i>{created}</i>
ru: <b>Профиль</b> Язык: <i>{locale}</i> Часовой пояс: <i>{timezone}</i> Сайт погоды: <i>{weather_provider}</i> День, когда Вы присоединились: <i>{created}</i>

source: You have no search history yet.
ru: У Вас пока нет истории поиска.

source: Select cities from your search history you want to delete:
ru: Выберите города из вашей истории поиска, которые хотите удалить:

source: No cities selected.
ru: Города не выбраны.

source: Selected cities deleted.
ru: Выбранные города удалены.

source: <b>Changing timezone.</b> You can choose a new time zone by choosing from the options below.
ru: <b>Изменение часовго пояса</b> Вы можете выбрать новый часовой пояс, выбрав один из вариантов ниже.

source: Choose a city in {country}:
ru: Выберите город в {country}:

source: Timezone successfully changed to {timezone}!
ru: Часовой пояс успешно изменен на {timezone}!

source: <b>Changing weather provider.</b> You can choose a new weather provider below:
ru: <b>Изменение сайта погоды</b> Вы можете выбрать новый сайт погоды ниже:

source: Weather provider successfully changed to {weather_provider}!
ru: Сайт погоды успешно изменен на {weather_provider}!

source: weather forecast
ru: прогноз погоды

source: Enter the name of the city / locality
ru: Введите название города / населенного пункта

source: Choose the city / locality you had in mind:
ru: Выберите город / населенный пункт, который Вы имели в виду:

source: ❌ Invalid number of arguments. Expected 4 arguments: [language code: {languages}] [weather provider: {providers}] [city] [period]
ru: ❌ Неверное количество аргументов. Ожидалось 4 аргумента: [код языка: {languages}] [сайт погоды: {providers}] [город] [период]

source: ❌ Unknown language code. Expected one of: {languages}
ru: ❌ Неизвестный код языка. Ожидался один из: {languages}

source: ❌ Unknown weather provider. Expected one of: {providers}
ru: ❌ Неизвестный сайт погоды. Ожидался один из: {providers}

source: ❌ Exact city not found. Fuzzy search is not allowed.
ru: ❌ Точный город не найден. Расплывчатый поиск не разрешен.

source: ❌ Invalid period.
ru: ❌ Неверный период.

source: Select the forecast period
ru: Выберите город / населенный пункт

source: Processing...
ru: Обработка...

source: Do you want to mute the mailing?
ru: Вы хотите включить режим без звука?

source: Weather forecast
ru: Прогноз погоды

source: Profile
ru: Профиль

source: Mailing
ru: Рассылка

source: End communication
ru: Закончить общение

source: 🔙 Back
ru: 🔙 Назад

source: Change the mute mode
ru: Изменить режим звука

source: Change the time
ru: Изменить время

source: Change the forecast period
ru: Изменить период прогноза

source: Change the city
ru: Изменить город

source: Unsubscribe
ru: Отписаться

source: Yes
ru: Да

source: No
ru: Нет

source: Retry the input
ru: Повторить ввод

source: Now
ru: Сейчас

source: Today
ru: Сегодня

source: Tomorrow
ru: Завтра

source: Week
ru: Неделя

source: Fortnight
ru: Две недели

source: Change language
ru: Изменить язык

source: Change timezone
ru: Изменить часовой пояс

source: Change weather provider
ru: Изменить сайт погоды

source: Manage search history
ru: Управление историей поиска

source: 🔙 Menu
ru: 🔙 Меню

source: 🔙 Profile
ru: 🔙 Профиль

source: An error occurred! 😥 The admins have already been notified about this and will fix the problem as soon as possible. Please, try again or restart the bot with the /start command.
ru: Произошла ошибка! 😥 Администраторы уже уведомлены об этом и исправят проблему как можно скорее. Пожалуйста, попробуйте еще раз или перезапустите бота командой /start.

source: Unfortunately, the weather provider server is not available now. The error is not connected with the bot. Please, try again later <b>OR</b> choose another weather provider:
ru: К сожалению, сервер сайта погоды сейчас недоступен. Ошибка не связана с ботом. Пожалуйста, попробуйте позже <b>ИЛИ</b> выберите другой сайт погоды:

source: Day
ru: Днем

source: Night
ru: Ночью
